{
    "messages": [
        "Let the fight begin!",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): patada derecha\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): puñetazo al menton\n",
        "Let the fight begin!",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): patada derecha\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): puñetazo al menton\n",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): golpe\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): se agacha\n",
        "Let the fight begin!",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): patada derecha\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): puñetazo al menton\n",
        "Let the fight begin!",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): patada derecha\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): puñetazo al menton\n",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): golpe\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): se agacha\n",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): saca pistola de balines y dispara\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): se asusta y lanza un puñetazo al aire\n",
        "Let the fight begin!",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): patada derecha\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): puñetazo al menton\n",
        "Let the fight begin!",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): patada derecha\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): puñetazo al menton\n",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): golpe\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): se agacha\n",
        "Let the fight begin!",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): patada derecha\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): puñetazo al menton\n",
        "Let the fight begin!",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): patada derecha\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): puñetazo al menton\n",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): golpe\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): se agacha\n",
        "Aquí tienes el siguiente movimiento del luchador 1 (Carlos): saca pistola de balines y dispara\n\nAquí tienes el siguiente movimiento del luchador 2 (Alejandro): se asusta y lanza un puñetazo al aire\n"
    ],
    "fight_evolution": [
        "Aquí tienes el escenario inicial de la pelea:\nMontañas, en medio de la naturaleza, absolutamente solos.\nSe percibe la brisa del viento y un pequeño riachuelo a lo lejos.\nA pesar de la niebla, los dos luchadores se miran ferozmente y saben que la pelea está a punto de comenzar...\n\nAquí tienes la descripción del luchador 1, Carlos: Carlos ha sido considerado un gran deportista durante mucho tiempo, pero últimamente no se mueve tanto y eso le está pasando factura. Sin embargo, su empeño y esfuerzo le hacen ser un combatiente peligroso.\n\nAquí tienes la descripción del luchador 2, Alejandro: Alejandro está en forma y está yendo al gimnasio. Cada vez tiene más músculo pero eso hace que sea un poco lento. Sus golpes son potentes y certeros.\n",
        "COMIENZA LA RONDA 1!",
        "Los dos luchadores se encuentran enfrentados en la niebla espesa, como si fueran protagonistas de una película de acción de bajo presupuesto. El viento sopla y la tensión se siente en el aire, acompasada por el suave murmullo del riachuelo que, irónicamente, parece estar esperando el desenlace.",
        "COMIENZA LA RONDA 2!",
        "¡Y aquí comienza la Ronda 2 de este épico enfrentamiento entre Carlos y Alejandro!\n\nLos luchadores están de pie, con intensas miradas de león y un poco de sudor en la frente que parece bailar al ritmo de la brisa. Carlos, con su determinación inquebrantable, decide que es el momento de lanzar un poderoso golpe.\n\n\"¡Pum!\" - exclama Carlos en un alarde de entusiasmo, mientras acerca su puño al rostro de Alejandro. A pesar de tener los músculos un poco oxidados, es un verdadero guerrero de corazón.\n\nCarlos lanza su puño como una catapulta de papas fritas, con toda la fuerza que puede reunir: 3 de fuerza, multiplicada por 1 (por el modificador de golpe). Así que los cálculos dictan… ¡son 3 puntos de daño que incapazmente vuelan hacia Alejandro!\n\nPero en un giro inesperado del destino, Alejandro, el fitness aficionado, decide que agacharse es su mejor opción. Con una agilidad que desafía la lógica, se desploma hacia el suelo como si intentara hacer una voltereta, aunque lo único que está haciendo es el movimiento de un velociraptor tratando de zafarse de un dinosaurio carnívoro.\n\nCarlos, que esperaba un contacto contundente, termina dando su golpe al aire, justo donde antes estaba Alejandro. “¡Eso no cuenta, verdad?”, dice Carlos con una cara que mezcla confusión e hilaridad.\n\nAlejandro, desde el suelo, sonríe con lo que a sus músculos les queda de energía. Desde esa posición, puede hasta ver cómo Carlos sigue con su balance como un pato sobre hielo, y se da cuenta de que podría ser importante para su siguiente movimiento. \n\nTras este espectáculo de acción improvisada, Carlos se da cuenta de que su golpe fue tan efectivo como intentar hacer una paella en una fogata de campamento. Aun así, la batalla continúa...\n\nEl resultado de la ronda es que:\n- Carlos no logra golpear a Alejandro, pero él tampoco sufre daño ya que va en el suelo. \n- Health Remaining Fighter1: 47 \n- Health Remaining Fighter2: 57 \nLos dos rivales se miran, algo confundidos, sabiendo que esto acaba de calentarse. ¡Y así termina la Ronda 2! Con risas y un poco de indignación entre amigos, ¿qué sorpresas nos traerá la siguiente ronda?",
        "COMIENZA LA RONDA 3!",
        "¡Y así, después de un par de minutos de tensiones acumuladas y risas nerviosas, comienza la Ronda 3! En el aire se siente una mezcla inconfundible de adrenalina y un ligero aroma a mejor de las aventurillas.\n\nCarlos, decidido a no dejar que un par de movimientos ridículos lo detengan, saca de su improvisada faja de cinturón una muy peligrosa… ¡pistola de balines! ¡Oh, la audacia!\n\n\"¡Esto se pondrá interesante!\", grita Carlos mientras apunta a Alejandro, que, por supuesto, no está exactamente preparado para un ataque de este tipo. Alejandro, que estaba un poco distraído pensando en su next-level combinación de proteínas, de repente ve al otro luchador listándose la pistola, y sus músculos se paralizan.\n\nPero Alejandro, en un alarde de instinto de supervivencia y un poco de pánico girando en su interior, decide lanzar un puñetazo al aire como si eso fuera a asustar a Carlos y su arma de balines. Espectacular. Con un movimiento que debería haber estado reservado para un opera de ballet moderno, Alejandro lanza su puño en un vacío existencial.  ¡Bam! El aire se estremece (o al menos eso quiere creer).\n\nCarlos, tratando de contener la risa ante el espectáculo tan surrealista, apretó el gatillo de su pistola.\n\"¡Chico, no quiero que pienses que eso era un mal movimiento!\", chilla mientras el balín vuela en dirección a Alejandro. El balín da en el punto débil de su agilidad, apuntando hacia su cara como un dardo desafiante.\n\n\"¡Ay!\" - grita Alejandro al recibir un pequeño golpe de balín en su mejilla. El impacto, aunque leve, despierta las risas en el aire, el balín brilla como un destello cómico.\n\nAsí, el combate termina en un despliegue de tropas disponibles:\n- Carlos se siente como un cowboy de película, pero con una pistola de balines, así que tal vez el estilo queda un poco \"fuera de lugar\". Finalmente, su golpe de audacia le causa un puntito de daño a Alejandro.\n- Alejandro, un guerrero en apuros, siente que la valentía de su movimiento no fue realmente suficiente para marcar su dominio sobre la batalla. Se aferra a su orgullo mientras respira hondo, esquivando balas y tomando riesgos.\n\nDespués de toda esta escena épica:\n- Daño a Alejandro: 1 por el balín. Aún así, su fuerte pero inteligente armadura le otorga una ligera resistencia. ¡Ay! - así que solo le queda 56 de salud.\n- Carlos sigue en pie, con 47 de vida.\n\nEl momento de comedia y acción culmina con ambos rivales mirando el uno al otro, entre risas y confusos murmullos del riachuelo detrás de ellos, como si el universo también estuviese de acuerdo en que esto podría ser la representación más extraña de una pelea en la historia. ¡Así termina la Ronda 3!",
        [
            "FIN DE LA PELEA!",
            "GANADOR: Carlos\nPERDEDOR: Alejandro"
        ]
    ]
}